<?php


////////////////////////////// (1) //////////////////////////////

$str = "my name is taymoor abdeen";
// íÌáÈ ÈÚÏ ßáãÉ ÇíÓ Çáì ÇÎíÑ
$firstName = strstr($str, "is");
echo $firstName . "<br>";


////////////////////////////// (2) //////////////////////////////

// íÌáÈ ÇäÏíßÓ ÇáßáãÉ ãÍÏÏÉ
$pos = stripos($str, "abdeen");
echo $pos . "<br>";

////////////////////////////// (3) //////////////////////////////

// ÚÑÖ ÚÏÏ ãÚíä ãä ÇáäÕ ÈÊÍÏíÏ ÑŞã ÇáÇäÏíßÓ ãä ÎØæÉ ÇáËÇäíÉ
$numberOfCharacter = substr($str, $pos, 3);
echo $numberOfCharacter . "<br>";

////////////////////////////// (4) //////////////////////////////

// ÌáÈ ãÍÊæì ÇáÕİÍÉ ÇáËÇäíÉ æáÇ íÊæŞİ ÇĞÇ ÛíÑ ãæÌæÏ
include_once("page2.php");

// íãßä æÖÚ ŞÈáå ÍÑİ @ áÊÌäÈ ÇÎØÇÁ
// @include_once("page2.php");

// Çæ íãßä Úä ØÑíŞ ÏÇáÉ Çíİ ÇáÔÑØíÉ Çæ ÛíÑåÇ

?>