<?php

////////////////////////////// (1) //////////////////////////////

// عملت مصفوفة اسمه نايمس
$names = array("taymoor", "ali", "luqman", "hussain","ali",  "omer", "taymoor");

// // اطبع مصفوفة حتى أتأكد
// echo "<pre>";
// print_r($names);
// echo "</pre>";


////////////////////////////// (2) //////////////////////////////

// قمت باضافة اسم عبدالهادي الى اخر المصفوفة عن طريق فنكشن بووش 
array_push($names, "abd-alhadi");

// قمت باضافة اسم محمد الى بداية المصفوفة عن طريق فنكشن ينشيفت 
array_unshift($names, "muhammed");


////////////////////////////// (3) //////////////////////////////

// ترتيب عناصر مصفوفة
sort($names);

// من اخطاء الشائعة يظن المبرمج ان الدالة ترجع مصفوفة فيقوم بارساله الى متغير اخر مثل ولكن دالة ترجع 1 فقط
// $newNames = sort($names);

// طباعة حتى اتأكد من ترتيب 
// echo "<pre>";
// print_r($names);
// echo "</pre>";


////////////////////////////// (4) //////////////////////////////

// تستخرج عدد معين من العناصر عشوائي

//  طريقة اولى
// استخرجت ثلاثة اينديكس عشوائي وخزنتها في متغير وينار
$winner = array_rand($names, 3);

// قمت بطباعة ثلاثة اسماء
foreach ( $winner as $value)
{
    echo $names[$value] . "<br />";
}


// طريقة الثانية
// عملت شفل للمصفوفة اي تغيرت اماكنهم عشوائيا
// shuffle($names);
// قمت بطباعة ثلاثة اسماء من بداية فيكون عشوائي بسبب شفل
// for($i = 0; $i < 3; $i++)
// {
//     echo $names[$i] . "<br />";
// }


////////////////////////////// (5) //////////////////////////////

// طباعة جميع عناصر المصفوفة بدون تكرار

$nameWithoutRepeart = array_unique($names);
array_unique($names);

// عرض حتى نتأكد من طباعة بدون تكرار
echo "<pre>";
print_r($nameWithoutRepeart);
echo "</pre>";

?>